[ 
    {
      "company": "Props Factory",
      "companyImg": "work/props.webp",
      "title": "Freelance - Project Supervisor",
      "description": "Overseeing of ongoing projects. Ensure that projects are running as intended. Coordinating and supervision of project.",
      "date": "2024 - Ongoing"
    },
    {
      "company": "Lagoon Laundry",
      "companyImg": "work/lagoon.png",
      "title": "Part Time - Customer Service",
      "description": "Led the initiative for the design of a new POS system, focusing on user-friendly features. Entrusted with the responsibility of managing the shop independently, ensuring smooth operations. Addressed and resolved over 1,000 customer enquiries and requests with a 95% satisfaction rate, contributing to a 20% increase in customer retention over a year.",
      "date": "2023 - Ongoing"
    },
    {
        "company": "FOSSIL",
        "companyImg": "work/fossil.png",
        "title": "Part Time - Retail Assistant",
        "description": "Mentored 5 newcomers, leading to an improvement in their knowledge and customer service ratings within their first three months. Contributed to the team’s effort in surpassing sales targets by 10%. This achievement was rooted in fostering genuine customer connections and a positive working environment.",
        "date": "2021 - 2023"
      },{
        "company": "Philips",
        "companyImg": "work/philips.png",
        "title": "Part Time - Customer Service",
        "description": "Issuing of gift vouchers at Phillips Redemption Counter. Tasked to manage customers in a polite and friendly manner. Trusted to handle cash vouchers and data entry",
        "date": "2020 - 2021"
      },{
        "company": "Aural Aid",
        "companyImg": "work/auralaid.png",
        "title": "Internship - Product Designer",
        "description": "Tasked to embark on a new design project and had to learn 'Grasshopper' from scratch. Revamped the company website and received compliments. Created product manuals and products for clients.",
        "date": "2018"
      }
  ]