[ 
    {
      "company": "Props Factory",
      "companyImg": "work/props.webp",
      "title": "Freelance - Project Supervisor",
      "description": "Facilitated weekly team meetings and reviews to ensure alignment with project goals and to address any concerns, fostering a collaborative work environment. Directed and coordinated project activities, including task assignment, progress tracking, and resource allocation, resulting in timely project completion. Managed operational protocols and established guidelines ensuring project adherence to industry standards and regulatory compliance.",
      "date": "2024 - Ongoing"
    },
    {
      "company": "Lagoon Laundry",
      "companyImg": "work/lagoon.png",
      "title": "Part Time - Customer Service",
      "description": "Led the initiative for the design of a new POS system, focusing on user-friendly features. Entrusted with the responsibility of managing the shop independently, ensuring smooth operations. Addressed and resolved over 1,000 customer enquiries and requests with a 95% satisfaction rate, contributing to a 20% increase in customer retention over a year.",
      "date": "2023 - Ongoing"
    },
    {
        "company": "FOSSIL",
        "companyImg": "work/fossil.png",
        "title": "Part Time - Retail Assistant",
        "description": "Mentored 5 newcomers, leading to an improvement in their knowledge and customer service ratings within their first three months. Contributed to the team's effort in surpassing sales targets by 10%. This achievement was rooted in fostering genuine customer connections and a positive working environment.",
        "date": "2021 - 2023"
      },{
        "company": "Philips",
        "companyImg": "work/philips.png",
        "title": "Part Time - Customer Service",
        "description": "Managed the Philips Redemption Counter, issuing gift vouchers and providing high-quality service to enhance customer satisfaction. Demonstrated excellent interpersonal skills by managing customer interactions with politeness and friendliness, ensuring a positive brand experience. Entrusted with the responsibility of handling cash vouchers, showcasing reliability and accuracy in financial transactions.",
        "date": "2020 - 2021"
      },{
        "company": "Aural Aid",
        "companyImg": "work/auralaid.png",
        "title": "Internship - Product Designer",
        "description": "Initiated and led a new product design project, rapidly learning and mastering ‘Grasshopper’ software to deliver innovative solutions. Overhauled the company's website, enhancing user experience and aesthetics, which garnered positive feedback from senior management. Designed and developed comprehensive product manuals and customized products that significantly improved client satisfaction and usability. ",
        "date": "2018"
      }
  ]